MyHome/src/Enums/мх_ТипыВнешнихСистем/мх_ТипыВнешнихСистем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>мх_ТипыВнешнихСистем</name>
  <enumValues>
    <name>Тинькофф</name>
  </enumValues>
  <enumValues>
    <name>Сбербанк</name>
  </enumValues>
</mdclass:Enum>

MyHome/src/Catalogs/мх_ВнешниеСистемы/мх_ВнешниеСистемы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мх_ВнешниеСистемы</name>
  <predefined>
    <items>
      <name>ЛичныйКабинетТинькофф</name>
      <description>Личный кабинет тинькофф</description>
    </items>
  </predefined>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>800</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресРесурса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>800</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТокенДоступа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>800</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>800</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗащищенноеСоединение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тинькофф_wuid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тинькофф_ИдентификаторСессии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тинькофф_ИдентификаторПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипВнешнейСистемы</name>
    <type>
      <types>EnumRef.мх_ТипыВнешнихСистем</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРегламентногоЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеРасписания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегламентноеЗаданиеИспользуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

MyHome/src/CommonModules/мх_ИнтеграцияСВнешнимиСистемами/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗагрузкаДанныхИзЛичныхКабинетовБанков(ИдентификаторыПлатежей) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторыПлатежей", ИдентификаторыПлатежей);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВнешниеСистемы.Ссылка КАК Ссылка,
	|	ВнешниеСистемы.ПометкаУдаления КАК ПометкаУдаления,
	|	ВнешниеСистемы.РегламентноеЗаданиеИспользуется КАК РегламентноеЗаданиеИспользуется,
	|	ВнешниеСистемы.ТипВнешнейСистемы КАК ТипВнешнейСистемы
	|ИЗ
	|	Справочник.мх_ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	ВнешниеСистемы.ИдентификаторРегламентногоЗадания В(&ИдентификаторыПлатежей)";

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда

		Если Не Выборка.РегламентноеЗаданиеИспользуется Или Выборка.ПометкаУдаления Тогда
			ВызватьИсключение НСтр("ru = 'Внешняя система не используется'");
		КонецЕсли;

		Результат = ВыполнитьОбработкуИнтеграцииСВнешнейСистемой(Выборка.Ссылка);

		Если Не Результат.Успех Тогда
			ВызватьИсключение Результат.ОписаниеОшибки;
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти       

#Область СлужебныйПрограммныйИнтерфейс

Функция ВыполнитьОбработкуИнтеграцииСВнешнейСистемой(ВнешняяСистема)
	
	Результат = Новый Структура("Успех, ОписаниеОшибки", Истина, "");
	
	ТипВнешнейСистемы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВнешняяСистема, "ТипВнешнейСистемы");
	ТипыВнешнихСистем = Перечисления.мх_ТипыВнешнихСистем;
	
	ТекущаяДата = ОбщегоНазначения.ТекущаяДатаПользователя();
	
	Если ТипВнешнейСистемы = ТипыВнешнихСистем.Тинькофф Тогда    
		
		Параметры = Новый Структура;
		Параметры.Вставить("ВнешняяСистема", ВнешняяСистема);
		Параметры.Вставить("ДатаНачала", НачалоДня(ТекущаяДата));
		Параметры.Вставить("ДатаОкончания", КонецДня(ТекущаяДата));
		
		Результат = мх_ИнтеграцияТинькофф.ПолучитьДанныеПлатежей(Параметры);
		
	ИначеЕсли ТипВнешнейСистемы = ТипыВнешнихСистем.Сбербанк Тогда
	Иначе
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Необрабатываемый тип внешней системы: %1'"), ТипВнешнейСистемы);
		Возврат мх_ИнтеграцияСВнешнимиСистемамиКлиентСервер.РезультатСОшибкой(ТекстОшибки, Результат);
	КонецЕсли;    
	
	Возврат Результат;
	
КонецФункции  

#КонецОбласти
